{
  "grade_2": {
    "words": [
      "cat",
      "dog",
      "sun",
      "moon",
      "star",
      "hat",
      "cup",
      "pen",
      "bed",
      "box",
      "tree",
      "leaf",
      "fish",
      "ball",
      "book",
      "car",
      "bus",
      "shoe",
      "bird",
      "milk",
      "run",
      "jump",
      "play",
      "eat",
      "drink",
      "red",
      "blue",
      "green",
      "yellow",
      "snow",
      "apple",
      "banana",
      "grape",
      "orange",
      "rice",
      "bread",
      "milk",
      "cake",
      "cookie",
      "egg",
      "mom",
      "dad",
      "baby",
      "brother",
      "sister",
      "family",
      "friend",
      "home",
      "school",
      "class",
      "chair",
      "table",
      "door",
      "window",
      "light",
      "clock",
      "sofa",
      "floor",
      "broom",
      "bedroom",
      "nose",
      "hand",
      "foot",
      "eye",
      "ear",
      "mouth",
      "face",
      "hair",
      "head",
      "leg",
      "happy",
      "sad",
      "mad",
      "fun",
      "nice",
      "kind",
      "funny",
      "silly",
      "tall",
      "short",
      "yes",
      "no",
      "go",
      "stop",
      "come",
      "look",
      "see",
      "help",
      "walk",
      "sit",
      "toy",
      "game",
      "box",
      "zip",
      "yarn",
      "nest",
      "lamp",
      "drum",
      "bell",
      "rug"
    ]
  },
  "grade_3": {
    "words": [
      "library",
      "mountain",
      "excited",
      "puzzle",
      "shadow",
      "treasure",
      "forest",
      "danger",
      "curious",
      "adventure",
      "bicycle",
      "journey",
      "whisper",
      "planet",
      "galaxy",
      "promise",
      "camera",
      "mystery",
      "tornado",
      "courage",
      "travel",
      "electric",
      "future",
      "holiday",
      "giraffe",
      "rocket",
      "discover",
      "mirror",
      "energy",
      "teacher",
      "recess",
      "homework",
      "subject",
      "project",
      "schedule",
      "nature",
      "animal",
      "fiction",
      "nonfiction",
      "chapter",
      "paragraph",
      "sentence",
      "grammar",
      "punctuation",
      "capital",
      "period",
      "comma",
      "question",
      "answer",
      "solution",
      "multiplication",
      "division",
      "addition",
      "subtraction",
      "fraction",
      "equation",
      "science",
      "experiment",
      "observe",
      "record",
      "geography",
      "continent",
      "ocean",
      "river",
      "desert",
      "volcano",
      "island",
      "climate",
      "weather",
      "temperature",
      "machine",
      "engine",
      "inventor",
      "history",
      "timeline",
      "artifact",
      "citizen",
      "community",
      "vote",
      "law",
      "respect",
      "responsibility",
      "honesty",
      "bravery",
      "kindness",
      "friendship",
      "cooperation",
      "leadership",
      "challenge",
      "success"
    ]
  },
  "grade_5": {
    "sentences": [
  "While I organized my desk, I found a missing pencil.",
  "While they painted the wall painting, other students watched in wonder.",
  "While she practiced her spelling words, her confidence grew.",
  "While we explored the library, we discovered a fascinating book.",
  "While he built the model airplane, he learned about physics.",
  "While the sun dipped below the horizon, we finished our art project.",
  "While the teacher demonstrated the experiment, we took careful notes.",
  "While the choir rehearsed, the audience waited eagerly.",
  "While I counted the coins, I saved enough money for a toy.",
  "While they organized the science fair, parents asked questions.",
  "Whenever we read aloud, our teacher praised our fluency.",
  "Whenever she solved a math problem, she felt proud.",
  "Whenever he scored a goal, his teammates cheered loudly.",
  "Whenever I practiced my handwriting, my letters became neater.",
  "Whenever they planted seeds, they watered them every morning.",
  "Whenever the class took a test, we reviewed our notes together.",
  "Whenever the bell rang, students walked to their next class quietly.",
  "Whenever she tried a new recipe, her family applauded her skills.",
  "Whenever he helped a friend, everyone appreciated his kindness.",
  "Whenever they set goals, they tracked their progress on a chart.",
  "Unless the library opens late, I will study after school.",
  "Unless it rains this afternoon, we will play outside.",
  "Unless she finishes reading the chapter, she cannot complete the quiz.",
  "Unless he sets an alarm, he might oversleep before the field trip.",
  "Unless we check our work, mistakes could slip through.",
  "Unless they bring their permission slips, they cannot attend the trip.",
  "Unless you follow the instructions, the experiment may fail.",
  "Unless the coach approves, the team cannot start practice.",
  "Unless I pack my bag tonight, I will forget my project tomorrow.",
  "Unless they save energy, the lights will go out faster.",
  "If I share my notes, I can help my classmates prepare for the test.",
  "If she practices her presentation, she will speak with confidence.",
  "If he listens carefully, he will understand the instructions.",
  "If we work together, we can finish the project early.",
  "If the bus arrives on time, we will reach school before the bell.",
  "If you ask questions, you will learn more.",
  "If they recycle their papers, they will help protect the environment.",
  "If I study vocabulary daily, I will remember new words easily.",
  "If she draws a map, she can find her way back to school.",
  "If he joins the club, he will make new friends.",
  "After I finished my essay, I revised it for clarity.",
  "After she completed the quiz, she checked her answers carefully.",
  "After we planted the seeds, we marked the date on the calendar.",
  "After he practiced coding, he debugged his program.",
  "After the sun set, the stars appeared in the sky.",
  "After they built the shelter, they tested its strength.",
  "After you solve the puzzle, show it to your teacher.",
  "After the movie ended, we discussed our favorite scenes.",
  "After the experiment succeeded, we wrote a lab report.",
  "After I read the poem, I drew a picture of its theme.",
  "Because the library closed early, I finished reading at home.",
  "Because she studied with a friend, she understood the lesson better.",
  "Because he practiced dribbling, he improved his soccer skills.",
  "Because we followed the recipe, the cookies turned out delicious.",
  "Because the instructions were clear, we completed the activity on time.",
  "Because they worked as a team, they solved the problem quickly.",
  "Because I asked for help, I completed the assignment successfully.",
  "Because she stayed focused, her grades improved.",
  "Because he saved his allowance, he bought a new book.",
  "Because the weather was perfect, we held the assembly outdoors.",
  "Before I started writing, I brainstormed my main ideas.",
  "Before she painted the canvas, she sketched a rough outline.",
  "Before we cooked dinner, we washed our hands thoroughly.",
  "Before he began the experiment, he gathered all the materials.",
  "Before the concert, the band rehearsed backstage.",
  "Before you answer the question, think about the details.",
  "Before the class began, students reviewed the homework.",
  "Before we left for the trip, we packed our suitcases carefully.",
  "Before I open the present, I guessed what it might be.",
  "Before they entered the museum, they read the exhibit signs.",
  "Even though the instructions were long, we completed the task.",
  "Even though she felt nervous, she spoke clearly in the play.",
  "Even though he had little time, he finished the project.",
  "Even though the story was challenging, we enjoyed reading it.",
  "Even though it was late, she stayed up to finish her drawing.",
  "Even though the questions were tough, he answered most of them.",
  "Even though we were tired, we studied late for the exam.",
  "Even though the parts were small, the model worked perfectly.",
  "Even though it rained, we carried on with the outdoor lesson.",
  "Even though the puzzle seemed impossible, they solved it.",
  "Since the teacher explained the concept, we grasped it quickly.",
  "Since I saved my work, I did not lose any progress.",
  "Since she practiced singing daily, her voice became stronger.",
  "Since he arrived early, he had time to prepare his presentation.",
  "Since we reviewed the notes, we felt ready for the test.",
  "Since the bell rang, we took our seats silently.",
  "Since they cleaned their room, they found the missing book.",
  "Since you finished first, you can help your classmates.",
  "Since the weather improved, we extended our playtime.",
  "Since I learned the chords, I can play the guitar song.",
  "Although the worksheet was long, we completed every question.",
  "Although she forgot her lines, she delivered the speech confidently.",
  "Although he lost the race, he congratulated the winner.",
  "Although the machine broke, we fixed it together.",
  "Although the paint was dry, the colors stayed bright.",
  "Although the traffic was heavy, we arrived on time.",
  "Although the math test was hard, we studied afterwards.",
  "Although the pages were torn, the story remained interesting.",
  "Although I lacked supplies, I created a wonderful project.",
  "Although they disagreed, they found a compromise."
]

  }
}
