{
  "grade_2": {
    "words": [
      "cat",
      "dog",
      "sun",
      "moon",
      "star",
      "hat",
      "cup",
      "pen",
      "bed",
      "box",
      "tree",
      "leaf",
      "fish",
      "ball",
      "book",
      "car",
      "bus",
      "shoe",
      "bird",
      "milk",
      "run",
      "jump",
      "play",
      "eat",
      "drink",
      "red",
      "blue",
      "green",
      "yellow",
      "snow",
      "apple",
      "banana",
      "grape",
      "orange",
      "rice",
      "bread",
      "milk",
      "cake",
      "cookie",
      "egg",
      "mom",
      "dad",
      "baby",
      "brother",
      "sister",
      "family",
      "friend",
      "home",
      "school",
      "class",
      "chair",
      "table",
      "door",
      "window",
      "light",
      "clock",
      "sofa",
      "floor",
      "broom",
      "bedroom",
      "nose",
      "hand",
      "foot",
      "eye",
      "ear",
      "mouth",
      "face",
      "hair",
      "head",
      "leg",
      "happy",
      "sad",
      "mad",
      "fun",
      "nice",
      "kind",
      "funny",
      "silly",
      "tall",
      "short",
      "yes",
      "no",
      "go",
      "stop",
      "come",
      "look",
      "see",
      "help",
      "walk",
      "sit",
      "toy",
      "game",
      "box",
      "zip",
      "yarn",
      "nest",
      "lamp",
      "drum",
      "bell",
      "rug"
    ]
  },
  "grade_3": {
    "words": [
      "library",
      "mountain",
      "excited",
      "puzzle",
      "shadow",
      "treasure",
      "forest",
      "danger",
      "curious",
      "adventure",
      "bicycle",
      "journey",
      "whisper",
      "planet",
      "galaxy",
      "promise",
      "camera",
      "mystery",
      "tornado",
      "courage",
      "travel",
      "electric",
      "future",
      "holiday",
      "giraffe",
      "rocket",
      "discover",
      "mirror",
      "energy",
      "teacher",
      "recess",
      "homework",
      "subject",
      "project",
      "schedule",
      "nature",
      "animal",
      "fiction",
      "nonfiction",
      "chapter",
      "paragraph",
      "sentence",
      "grammar",
      "punctuation",
      "capital",
      "period",
      "comma",
      "question",
      "answer",
      "solution",
      "multiplication",
      "division",
      "addition",
      "subtraction",
      "fraction",
      "equation",
      "science",
      "experiment",
      "observe",
      "record",
      "geography",
      "continent",
      "ocean",
      "river",
      "desert",
      "volcano",
      "island",
      "climate",
      "weather",
      "temperature",
      "machine",
      "engine",
      "inventor",
      "history",
      "timeline",
      "artifact",
      "citizen",
      "community",
      "vote",
      "law",
      "respect",
      "responsibility",
      "honesty",
      "bravery",
      "kindness",
      "friendship",
      "cooperation",
      "leadership",
      "challenge",
      "success"
    ]
  },
  "grade_5": {
    "sentences": [
      "While I read the chapter, he got a second chance.",
      "Whenever he practiced every day, everyone cheered.",
      "Unless the weather was stormy, he asked a question.",
      "If he practiced every day, he asked a question.",
      "If the lights went out, she found it interesting.",
      "After we studied together, she succeeded at the test.",
      "Because the lights went out, they celebrated.",
      "After the lights went out, he got a second chance.",
      "Because the lights went out, she succeeded at the test.",
      "Before they arrived early, they celebrated.",
      "Even though the game ended, she found it interesting.",
      "If she tried her best, he got a second chance.",
      "Even though she tried her best, he asked a question.",
      "Because he forgot his homework, he got a second chance.",
      "Since the game ended, it was confusing.",
      "Even though I read the chapter, he got a second chance.",
      "If I read the chapter, she succeeded at the test.",
      "Before the teacher explained the topic, it became easier.",
      "Since I read the chapter, it was confusing.",
      "Whenever he practiced every day, everyone cheered.",
      "Unless I read the chapter, she succeeded at the test.",
      "If the game ended, he got a second chance.",
      "Although he practiced every day, he got a second chance.",
      "After I read the chapter, it was confusing.",
      "Unless he practiced every day, he got a second chance.",
      "Unless he practiced every day, it was confusing.",
      "Since they arrived early, they still had fun.",
      "After we studied together, he got a second chance.",
      "Although the weather was stormy, they still had fun.",
      "Before I read the chapter, she found it interesting.",
      "While he practiced every day, it became easier.",
      "Because the game ended, he asked a question.",
      "Although the game ended, it was confusing.",
      "Since the teacher explained the topic, she succeeded at the test.",
      "If the weather was stormy, everyone cheered.",
      "If I read the chapter, they celebrated.",
      "While I read the chapter, she found it interesting.",
      "While she tried her best, we learned a lot.",
      "Because he forgot his homework, it was confusing.",
      "If the weather was stormy, it became easier.",
      "After I read the chapter, he got a second chance.",
      "Whenever we studied together, it became easier.",
      "Although the lights went out, we learned a lot.",
      "Before she tried her best, he asked a question.",
      "Although they arrived early, he got a second chance.",
      "Since the game ended, he got a second chance.",
      "After the game ended, he got a second chance.",
      "Although the lights went out, they still had fun.",
      "Since she tried her best, it was confusing.",
      "Before the weather was stormy, she found it interesting.",
      "Unless she tried her best, it became easier.",
      "Unless the game ended, it was confusing.",
      "Since the game ended, we learned a lot.",
      "Because we studied together, it became easier.",
      "Because he practiced every day, it was confusing.",
      "After the weather was stormy, we learned a lot.",
      "Since I read the chapter, they celebrated.",
      "Because she tried her best, she succeeded at the test.",
      "While he practiced every day, it was confusing.",
      "Although the teacher explained the topic, they still had fun.",
      "Since the weather was stormy, she succeeded at the test.",
      "Unless we studied together, it was confusing.",
      "Since he practiced every day, he got a second chance.",
      "Before he practiced every day, we learned a lot.",
      "Since they arrived early, we learned a lot.",
      "Since we studied together, it was confusing.",
      "While he practiced every day, he asked a question.",
      "Since they arrived early, we learned a lot.",
      "Unless we studied together, it became easier.",
      "Before I read the chapter, he asked a question.",
      "Whenever we studied together, everyone cheered.",
      "Even though the game ended, he asked a question.",
      "Because the game ended, they still had fun.",
      "Although he forgot his homework, they celebrated.",
      "Whenever she tried her best, they celebrated.",
      "Even though the game ended, it was confusing.",
      "While he forgot his homework, everyone cheered.",
      "Unless the lights went out, he asked a question.",
      "Although he forgot his homework, she succeeded at the test.",
      "While we studied together, we learned a lot.",
      "While the game ended, everyone cheered.",
      "Before I read the chapter, it was confusing.",
      "Although the game ended, they still had fun.",
      "Since they arrived early, she succeeded at the test.",
      "Although the weather was stormy, they celebrated.",
      "Since the lights went out, he asked a question.",
      "Since the lights went out, he got a second chance.",
      "Because the game ended, she found it interesting.",
      "Although the teacher explained the topic, she succeeded at the test.",
      "Even though she tried her best, he got a second chance.",
      "Although the game ended, he asked a question.",
      "Because I read the chapter, she found it interesting.",
      "While the teacher explained the topic, they still had fun.",
      "While we studied together, it was confusing.",
      "Unless they arrived early, she found it interesting.",
      "Although we studied together, it became easier.",
      "While the teacher explained the topic, she found it interesting.",
      "Before they arrived early, it was confusing.",
      "Whenever the game ended, he got a second chance.",
      "Even though they arrived early, they celebrated."
    ]
  }
}
